bubble2/0.orig/alpha.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    airInlets
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    waterInlets
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    overflow
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }    
}


// ************************************************************************* //
