bubble2/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    faceGrabbed_1;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.1 -1 -0.0001) (0.1025 1 0.0001);
        }
    }
    {
        name    faceGrabbed_1;
        type    faceSet;
        action  add;
        source  boxToFace;
        sourceInfo
        {
            box (0.1475 -1 -0.0001) (0.1500 1 0.0001);
        }
    }
    {
        name    faceGrabbed_2;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0.199 -1 0.05) (0.201 1 0.06);
        }
    }
    {
        name    faceGrabbed_3;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (0 -1 -0.0001) (0.04 1 0.0001);
        }
    }
    {
        name    overFlowWall;
        type    cellSet;
        action  clear;
    }
    {
        name    overFlowWall;
        type    cellSet;
        action  invert;
    }
    {
        name    overFlowWall;
        type    cellSet;
        action  delete;
        source  boxToCell;
        sourceInfo
        {
            box (0.04 -1 0.0) (0.05 1 0.4);
        }
    }
);


// ************************************************************************* //
